{"status": "ok", "total_hits": 10000, "page": 1, "total_pages": 10000, "page_size": 1, "articles": [{"title": "JPMorgan Chase & Co. (JPM) Benefited from the Stabilized Banking Industry", "author": "Soumya Eswaran", "published_date": "2023-09-12 07:17:26", "published_date_precision": "full", "link": "https://finance.yahoo.com/news/jpmorgan-chase-co-jpm-benefited-071726371.html", "clean_url": "yahoo.com", "excerpt": "Carillon Tower Advisers, an investment management company, released its 'Carillon Eagle Growth & Income Fund' Q2 2023 investor letter. A copy of the same can be downloaded here. The S&P Index closed…", "summary": "Carillon Tower Advisers, an investment management company, released its 'Carillon Eagle Growth & Income Fund' Q2 2023 investor letter. A copy of the same can be downloaded here. The S&P Index closed the quarter with a gain of 8.7%, which made the first half of the year's return rose 16%. These gains suggest steady growth, but the reality is much more mixed. Macroeconomic fears still exist in the market. In addition, you can check the top 5 holdings of the fund to know its best picks in 2023.\nCarillon Eagle Growth & Income Fund highlighted stocks like JPMorgan Chase & Co. (NYSE:JPM) in the second quarter 2023 investor letter. Headquartered in New York, New York, JPMorgan Chase & Co. (NYSE:JPM) is a financial services company. On September 11, 2023, JPMorgan Chase & Co. (NYSE:JPM) stock closed at $144.46 per share. One-month return of JPMorgan Chase & Co. (NYSE:JPM) was -4.22%, and its shares gained 24.12% of their value over the last 52 weeks. JPMorgan Chase & Co. (NYSE:JPM) has a market capitalization of $419.814 billion.\nCarillon Eagle Growth & Income Fund made the following comment about JPMorgan Chase & Co. (NYSE:JPM) in its Q2 2023 investor letter:\n\"Shares of JPMorgan Chase & Co. (NYSE:JPM) contributed to performance as the banking industry stabilized in the aftermath of the March bank liquidity crisis. Capital markets activity now appears to be more benign. During the banking crisis, JPMorgan Chase was seen as a safe haven because of its strong balance sheet. That view helped the firm outperform its smaller peers that faced unprecedented outflows of deposits.\"\npcruciatti / Shutterstock.com\nJPMorgan Chase & Co. (NYSE:JPM) is in 19th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 106 hedge fund portfolios held JPMorgan Chase & Co. (NYSE:JPM) at the end of second quarter which was 112 in the previous quarter.\nWe discussed JPMorgan Chase & Co. (NYSE:JPM) in another article and shared the list of most profitable dividend stocks. In addition, please check out our hedge fund investor letters Q2 2023 page for more investor letters from hedge funds and other leading investors.\n\nSuggested Articles:\n\n\n\nDisclosure: None. This article is originally published at Insider Monkey.", "rights": "yahoo.com", "rank": 31, "topic": "finance", "country": "US", "language": "en", "authors": "Soumya Eswaran", "media": "https://media.zenfs.com/en/insidermonkey.com/44f165e28c33f56ef0f1d3520099dc7e", "is_opinion": false, "twitter_account": "@YahooFinance", "_score": 18.924332, "_id": "73c3e331e780883055cbee529e5c0c9b"}], "user_input": {"q": "JPMorgan Chase", "search_in": ["title_summary_en"], "lang": ["en"], "not_lang": null, "countries": ["US"], "not_countries": null, "from": "2023-09-07 00:00:00", "to": null, "ranked_only": "True", "from_rank": null, "to_rank": null, "sort_by": "relevancy", "page": 1, "size": 1, "sources": null, "not_sources": [], "topic": null, "published_date_precision": null}}