{"status": "ok", "total_hits": 10000, "page": 1, "total_pages": 10000, "page_size": 1, "articles": [{"title": "Wells Fargo Donates $500,000 to Florida Disaster Fund for Hurricane Relief", "author": "Wells Fargo", "published_date": "2023-09-11 16:45:00", "published_date_precision": "full", "link": "https://finance.yahoo.com/news/wells-fargo-donates-500-000-164500657.html", "clean_url": "yahoo.com", "excerpt": "Wells Fargo is donating $500,000 to the Florida Disaster Fund, led by Volunteer Florida, to aid in the aftermath of Hurricane Idalia and the emergency response, including shelter, supplies, and…", "summary": "SAN FRANCISCO, CA / ACCESSWIRE / September 11, 2023 / Wells Fargo is donating $500,000 to the Florida Disaster Fund, led by Volunteer Florida, to aid in the aftermath of Hurricane Idalia and the emergency response, including shelter, supplies, and services for those displaced. In addition, customer accommodations are available for Floridians directly impacted by the storm.\n\"Supporting customers, employees, and communities across the state as they recover from the hurricane is a priority for us,\" said Wells Fargo CEO Charles Scharf. \"We are grateful for Volunteer Florida's leadership in local relief efforts and its ability to offer essential services in the wake of the devastation. Our donation is aimed at expanding its capacity to reach those who need it most.\"\n\"On behalf of Volunteer Florida, we would like to thank Wells Fargo for their significant financial contribution to the Florida Disaster Fund in response to the statewide recovery efforts from Hurricane Idalia,\" said CEO of Volunteer Florida Josie Tamayo. \"Their contribution to the Florida Disaster Fund will help relief organizations in rebuilding our affected communities.\"\nAdditional community support\nWells Fargo's ongoing collaboration with Team Rubicon's Ready Reserve Fund is unlocking Team Rubicon's ability to quickly clear debris off roadways to allow access for first responders and aid workers in disaster impacted communities. Team Rubicon is a veteran‑led humanitarian organization that supports before, during, and after natural disasters and other crises.\nCaring for customers\nWells Fargo is committed to providing support to its customers, clients, and employees affected by Hurricane Idalia, including suppressing, waiving, or reversing certain fees, such as late fees. Payment assistance and disaster relief options require that customers contact Wells Fargo. Customers who want to discuss their financial needs should call 1‑800‑219‑9739. For up‑to‑date information on branch status, customers can visit Wells Fargo's branch locator website.\nAbout Wells Fargo\nWells Fargo & Company (NYSE:WFC) is a leading financial services company that has approximately $1.9 trillion in assets, proudly serves one in three U.S. households and more than 10% of small businesses in the U.S., and is a leading middle market banking provider in the U.S. We provide a diversified set of banking, investment, and mortgage products and services, as well as consumer and commercial finance, through our four reportable operating segments: Consumer Banking and Lending, Commercial Banking, Corporate and Investment Banking, and Wealth & Investment Management. Wells Fargo ranked No. 47 on Fortune's 2023 rankings of America's largest corporations. In the communities we serve, the company focuses its social impact on building a sustainable, inclusive future for all by supporting housing affordability, small business growth, financial health, and a low‑carbon economy.\nNews, insights, and perspectives from Wells Fargo are also available at Wells Fargo Stories.\nAdditional information may be found at http://www.wellsfargo.com | Twitter: @WellsFargo\n*The American Red Cross name, emblem, and copyrighted materials are being used with its permission, which in no way constitutes an endorsement, express or implied, of any product, service, company, opinion, or political position. The American Red Cross logo is a registered trademark owned by The American National Red Cross. For more information about the American Red Cross, please visit redcross.org.\n\nContact Info:Spokesperson: Wells FargoWebsite: https://www.3blmedia.com/profiles/wells-fargoEmail: info@3blmedia.com\nSOURCE: Wells Fargo\nView source version on accesswire.com: https://www.accesswire.com/782860/wells-fargo-donates-500000-to-florida-disaster-fund-for-hurricane-relief", "rights": "yahoo.com", "rank": 31, "topic": "news", "country": "US", "language": "en", "authors": "Wells Fargo", "media": "https://media.zenfs.com/en/accesswire.ca/3b861db96750f2e6c95a729c61a2bbbd", "is_opinion": false, "twitter_account": "@YahooFinance", "_score": 14.030108, "_id": "2dca5ee31fdfabfd8bfdd6b52e7f7246"}], "user_input": {"q": "Wells Fargo", "search_in": ["title_summary_en"], "lang": ["en"], "not_lang": null, "countries": ["US"], "not_countries": null, "from": "2023-09-07 00:00:00", "to": null, "ranked_only": "True", "from_rank": null, "to_rank": null, "sort_by": "relevancy", "page": 1, "size": 1, "sources": null, "not_sources": [], "topic": null, "published_date_precision": null}}